{
  "extraction_timestamp": "2025-07-29T06:18:42.838518",
  "total_articles": 22,
  "articles_with_images": 21,
  "image_success_rate": "95.5%",
  "sources_processed": 5,
  "api_source": "newsapi.org",
  "categories": [
    "international",
    "us_news",
    "technology",
    "business",
    "sports",
    "indian_news",
    "geopolitics",
    "trending",
    "regional"
  ],
  "by_category": {
    "international": [],
    "us_news": [],
    "technology": [],
    "business": [],
    "sports": [],
    "indian_news": [],
    "geopolitics": [
      {
        "title": "Europe hopes for 'no surprises' as US weighs force withdrawals",
        "url": "https://economictimes.indiatimes.com/news/international/global-trends/europe-hopes-for-no-surprises-as-us-weighs-force-withdrawals/articleshow/122944480.cms",
        "published": "2025-07-28T03:59:35Z",
        "summary": "After keeping Donald Trump happy with a pledge to up defence spending at NATO's summit, Europe is now bracing for a key decision from the US president on the future of American forces on the continent. While successive US governments have mulled scaling back …",
        "description": "After keeping Donald Trump happy with a pledge to up defence spending at NATO's summit, Europe is now bracing for a key decision from the US president on the future of American forces on the continen… [+3974 chars]",
        "source": "The Times of India",
        "category": "geopolitics",
        "image_url": "https://img.etimg.com/thumb/msid-122944490,width-1200,height-630,imgsize-167082,overlay-economictimes/articleshow.jpg",
        "key_points": [
          "After keeping Donald Trump happy with a pledge to up defence spending at NATOs summit, Europe is now bracing for a key decision from the US president on the future of American forces on the continen 3974 chars.",
          "Europe hopes for no surprises as US weighs force withdrawals."
        ],
        "geopolitical_topic": "Ukraine war",
        "topic_type": "current_conflict"
      },
      {
        "title": "Europe Hopes For 'No Surprises' As US Weighs Force Withdrawals",
        "url": "https://www.ibtimes.com/europe-hopes-no-surprises-us-weighs-force-withdrawals-3779583",
        "published": "2025-07-28T03:27:10Z",
        "summary": "After keeping Donald Trump happy with a pledge to up defence spending at NATO's summit, Europe is now bracing for a key decision from the US president on the future of American forces on the continent.",
        "description": "After keeping Donald Trump happy with a pledge to up defence spending at NATO's summit, Europe is now bracing for a key decision from the US president on the future of American forces on the continen… [+3870 chars]",
        "source": "International Business Times",
        "category": "geopolitics",
        "image_url": "https://d.ibtimes.com/en/full/4613136/united-states-conducting-review-its-military-deployments-worldwide.jpg",
        "key_points": [
          "After keeping Donald Trump happy with a pledge to up defence spending at NATOs summit, Europe is now bracing for a key decision from the US president on the future of American forces on the continen 3870 chars.",
          "Europe Hopes For No Surprises As US Weighs Force Withdrawals."
        ],
        "geopolitical_topic": "Ukraine war",
        "topic_type": "current_conflict"
      },
      {
        "title": "Kim Jong Un’s powerful sister rejects appeasement overture by South’s new president",
        "url": "https://nypost.com/2025/07/27/world-news/kim-jong-uns-powerful-sister-rejects-appeasement-overture-by-souths-new-president/",
        "published": "2025-07-28T01:59:52Z",
        "summary": "Kim Jong Un's sister dismisses South Korea's peace offers, reaffirming no interest in talks.",
        "description": "SEOUL, South Korea  The influential sister of North Korean leader Kim Jong Un rebuffed an appeasement overture by South Koreas new liberal government, saying Monday that North Korea has no interests … [+3816 chars]",
        "source": "New York Post",
        "category": "geopolitics",
        "image_url": "https://nypost.com/wp-content/uploads/sites/2/2025/07/kim-jong-uns-powerful-sister-108858951.jpg?quality=75&strip=all&w=1024",
        "key_points": [
          "SEOUL, South Korea The influential sister of North Korean leader Kim Jong Un rebuffed an appeasement overture by South Koreas new liberal government, saying Monday that North Korea has no interests 3816 chars.",
          "Kim Jong Uns powerful sister rejects appeasement overture by Souths new president."
        ],
        "geopolitical_topic": "Ukraine war",
        "topic_type": "current_conflict"
      },
      {
        "title": "Powerful sister of North Korean leader Kim rejects outreach by South’s new president",
        "url": "https://www.politico.com/news/2025/07/27/powerful-sister-of-north-korean-leader-kim-rejects-outreach-by-souths-new-president-00479597",
        "published": "2025-07-28T01:59:27Z",
        "summary": "Kim Yo Jong said her government has \"no interest\" in talks.",
        "description": "SEOUL, South Korea The influential sister of North Korean leader Kim Jong Un rebuffed overtures by South Koreas new liberal government, saying Monday that North Korea has no interests in talks with S… [+3221 chars]",
        "source": "Politico",
        "category": "geopolitics",
        "image_url": "https://s.yimg.com/ny/api/res/1.2/XhCJTRBs351EaWkh4w9I0g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04NzM7Y2Y9d2VicA--/https://media.zenfs.com/en/politico_453/9ee9c1fda911b43801951f589ca5a0f1",
        "key_points": [
          "Powerful sister of North Korean leader Kim rejects outreach by Souths new president.",
          "SEOUL, South Korea The influential sister of North Korean leader Kim Jong Un rebuffed overtures by South Koreas new liberal government, saying Monday that North Korea has no interests in talks with S 3221 chars."
        ],
        "geopolitical_topic": "Ukraine war",
        "topic_type": "current_conflict"
      },
      {
        "title": "Pixelworks (NASDAQ:PXLW) Upgraded to “Sell” at Wall Street Zen",
        "url": "https://www.etfdailynews.com/2025/07/28/pixelworks-nasdaqpxlw-upgraded-to-sell-at-wall-street-zen/",
        "published": "2025-07-28T05:52:46Z",
        "summary": "Pixelworks (NASDAQ:PXLW – Get Free Report) was upgraded by analysts at Wall Street Zen to a “sell” rating in a research note issued to investors on Saturday. PXLW has been the subject of a number of other research reports. Needham & Company LLC reiterated a “…",
        "description": "Pixelworks (NASDAQ:PXLW – Get Free Report) was upgraded by analysts at Wall Street Zen to a “sell” rating in a research note issued to investors on Saturday.\r\nPXLW has been the subject of a number of… [+2909 chars]",
        "source": "ETF Daily News",
        "category": "geopolitics",
        "image_url": "https://www.americanbankingnews.com/wp-content/timthumb/timthumb.php?src=https://www.marketbeat.com/logos/pixelworks-logo-1200x675.gif&w=240&h=240&zc=2",
        "key_points": [
          "Pixelworks NASDAQ:PXLW Get Free Report was upgraded by analysts at Wall Street Zen to a sell rating in a research note issued to investors on Saturday.",
          "PXLW has been the subject of a number of 2909 chars."
        ],
        "geopolitical_topic": "China Taiwan",
        "topic_type": "current_conflict"
      },
      {
        "title": "Taiwan reports continued Chinese military activity around its territory",
        "url": "https://economictimes.indiatimes.com/news/defence/taiwan-reports-continued-chinese-military-activity-around-its-territory/articleshow/122943704.cms",
        "published": "2025-07-28T02:56:58Z",
        "summary": "Taiwan's Defence Ministry reports Chinese military activity near its territory. Four Chinese aircraft and ten naval vessels were observed. The aircraft crossed the median line into Taiwan's air defence zone. This activity follows similar incursions reported o…",
        "description": "Taiwan's Ministry of Defence (MND) on Monday detected four sorties of PLA aircraft and detected 10 PLAN vessels operating around its territory.In a post on X, the MND stated that four out of four sor… [+2127 chars]",
        "source": "The Times of India",
        "category": "geopolitics",
        "image_url": "https://img.etimg.com/thumb/msid-122943709,width-1200,height-630,imgsize-11450,overlay-etdefence/articleshow.jpg",
        "key_points": [
          "Taiwans Ministry of Defence MND on Monday detected four sorties of PLA aircraft and detected 10 PLAN vessels operating around its territory.",
          "Taiwan reports continued Chinese military activity around its territory.",
          "In a post on X, the MND stated that four out of four sor 2127 chars."
        ],
        "geopolitical_topic": "China Taiwan",
        "topic_type": "current_conflict"
      }
    ],
    "trending": [
      {
        "title": "Wairoa Show will go ahead for 125th anniversary in 2026",
        "url": "https://www.nzherald.co.nz/hawkes-bay-today/news/wairoa-show-will-go-ahead-for-125th-anniversary-in-2026/4QG3FD3RABAP7PARA7QPPXOKEA/",
        "published": "2025-07-28T06:18:03Z",
        "summary": "The A&P president hasn't had a show under his watch – but won't go before there is one.",
        "description": "In 2010 and 2020 the shows went ahead despite heavy rain, but popular attraction the shearing had to be held elsewhere because trucks were at risk of bogging down trying to get the sheep in and out o… [+2457 chars]",
        "source": "New Zealand Herald",
        "category": "trending",
        "image_url": "https://www.nzherald.co.nz/resizer/v2/XU46Z6JLMZAM5BYT5EWUPGXSLU.jpg?auth=edca7b34559a30fd3cdf571ca0b696d391dff69d9dbf88734037d9e3b86e7601&width=1200&height=675&quality=70&smart=true",
        "key_points": [
          "In 2010 and 2020 the shows went ahead despite heavy rain, but popular attraction the shearing had to be held elsewhere because trucks were at risk of bogging down trying to get the sheep in and out o 2457 chars.",
          "Wairoa Show will go ahead for 125th anniversary in 2026."
        ]
      },
      {
        "title": "Matcha latte prices set to soar as global craze and record-breaking heatwave fuel supply chain crisis",
        "url": "https://www.the-independent.com/asia/japan/matcha-shortage-japan-global-supply-heatwave-b2797101.html",
        "published": "2025-07-28T06:05:06Z",
        "summary": "Matcha prices are expected to rise further after the United States announced 15 per cent tariffs on Japanese imports",
        "description": "Your support helps us to tell the story\r\nFrom reproductive rights to climate change to Big Tech, The Independent is on the ground when the story is developing. Whether it's investigating the financia… [+3474 chars]",
        "source": "The-independent.com",
        "category": "trending",
        "image_url": "https://static.the-independent.com/2025/07/26/15/34/iStock-2199126862.jpg?width=1200&height=800&crop=1200:800",
        "key_points": [
          "Whether its investigating the financia 3474 chars.",
          "Matcha latte prices set to soar as global craze and record-breaking heatwave fuel supply chain crisis.",
          "Your support helps us to tell the story From reproductive rights to climate change to Big Tech, The Independent is on the ground when the story is developing."
        ]
      },
      {
        "title": "Bureau Veritas Partners with IFC’s Building Resilience Index to Expand Resilience Verification Services Globally",
        "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/bureau-veritas-partners-with-ifcs-building-resilience-index-to-expand-resilience-verification-services-globally",
        "published": "2025-07-28T06:02:35Z",
        "summary": "PARIS — Bureau Veritas, a global leader in Testing, Inspection, and Certification services (TIC), has signed the first global verifier agreement to expand the reach and impact of the Building Resilience Index (BRI). Under this agreement, Bureau Veritas will s…",
        "description": "PARIS Bureau Veritas, a global leader in Testing, Inspection, and Certification services (TIC), has signed the first global verifier agreement to expand the reach and impact of the Building Resilienc… [+7485 chars]",
        "source": "Financial Post",
        "category": "trending",
        "image_url": "https://smartcdn.gprod.postmedia.digital/financialpost/wp-content/uploads/2025/07/bw20250727906462_marc_roussel_tl25-2483_rt.jpeg",
        "key_points": [
          "PARIS Bureau Veritas, a global leader in Testing, Inspection, and Certification services TIC, has signed the first global verifier agreement to expand the reach and impact of the Building Resilienc 7485 chars.",
          "Bureau Veritas Partners with IFCs Building Resilience Index to Expand Resilience Verification Services Globally."
        ]
      },
      {
        "title": "The Open Group Launches The Open Group Open Digital Transformation™ Forum",
        "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/the-open-group-launches-the-open-group-open-digital-transformation-forum",
        "published": "2025-07-28T06:02:16Z",
        "summary": "Standards body aims to spur faster, more effective transformation initiatives SAN FRANCISCO — The Open Group, the vendor-neutral technology consortium, has today announced the formation of The Open Group Open Digital Transformation™ Forum (ODXF). This new ini…",
        "description": "THIS CONTENT IS RESERVED FOR SUBSCRIBERS ONLY\r\nSubscribe now to read the latest news in your city and across Canada.\r\n<ul><li>Exclusive articles from Barbara Shecter, Joe O'Connor, Gabriel Friedman, … [+5060 chars]",
        "source": "Financial Post",
        "category": "trending",
        "image_url": "",
        "key_points": []
      },
      {
        "title": "GitHub Spark : No Code? No Problem! Build Full Stack Apps Easily",
        "url": "https://www.geeky-gadgets.com/github-spark-ai-app-builder/",
        "published": "2025-07-28T06:07:09Z",
        "summary": "What if building a fully functional app was as simple as describing it in plain language? With the launch of GitHub Spark, that vision is now a reality. This new AI-powered platform is set to redefine how applications are created, offering a streamlined, brow…",
        "description": "What if building a fully functional app was as simple as describing it in plain language? With the launch of GitHub Spark, that vision is now a reality. This new AI-powered platform is set to redefin… [+6820 chars]",
        "source": "Geeky Gadgets",
        "category": "trending",
        "image_url": "https://www.geeky-gadgets.com/wp-content/uploads/2025/07/github-spark-ai-app-builder_optimized.jpg",
        "key_points": [
          "This new AI-powered platform is set to redefin 6820 chars.",
          "What if building a fully functional app was as simple as describing it in plain language.",
          "GitHub Spark : No Code.",
          "With the launch of GitHub Spark, that vision is now a reality.",
          "Build Full Stack Apps Easily."
        ]
      },
      {
        "title": "Context: UK distribution shows strength in Q2",
        "url": "https://www.computerweekly.com/microscope/news/366628160/Context-UK-distribution-shows-strength-in-Q2",
        "published": "2025-07-28T06:06:00Z",
        "summary": "Second-quarter growth enjoyed by UK distributors was better than that experienced by continental counterparts",
        "description": "The word that has often been associated with the channel is evolution, referring to the legendary ability to adapt to changing circumstances, but these days, that has been replaced by resilience.\r\nTh… [+3403 chars]",
        "source": "ComputerWeekly.com",
        "category": "trending",
        "image_url": "https://www.computerweekly.com/visuals/ComputerWeekly/Hero Images/growth-strategy-graph-adobe.jpg",
        "key_points": [
          "The word that has often been associated with the channel is evolution, referring to the legendary ability to adapt to changing circumstances, but these days, that has been replaced by resilience.",
          "Context: UK distribution shows strength in Q2."
        ]
      },
      {
        "title": "Top Digital Media Stocks To Consider – July 26th",
        "url": "https://www.etfdailynews.com/2025/07/28/top-digital-media-stocks-to-consider-july-26th/",
        "published": "2025-07-28T06:02:47Z",
        "summary": "Alibaba Group, Adobe, and Digital Realty Trust are the three Digital Media stocks to watch today, according to MarketBeat’s stock screener tool. Digital media stocks are shares of publicly traded companies that create, distribute and monetize content through …",
        "description": "Alibaba Group, Adobe, and Digital Realty Trust are the three Digital Media stocks to watch today, according to MarketBeat’s stock screener tool. Digital media stocks are shares of publicly traded com… [+3853 chars]",
        "source": "ETF Daily News",
        "category": "trending",
        "image_url": "https://www.americanbankingnews.com/wp-content/timthumb/timthumb.php?src=https://www.marketbeat.com/logos/alibaba-group-holding-limited-logo-1200x675.png?v=20221020143329&w=240&h=240&zc=2",
        "key_points": [
          "Alibaba Group, Adobe, and Digital Realty Trust are the three Digital Media stocks to watch today, according to MarketBeats stock screener tool.",
          "Top Digital Media Stocks To Consider July 26th.",
          "Digital media stocks are shares of publicly traded com 3853 chars."
        ]
      },
      {
        "title": "AI Mode Shortcut in Google for Android Said to Be Coming to More Users",
        "url": "https://www.gadgets360.com/ai/news/ai-mode-google-search-shortcut-android-app-rolling-out-to-more-users-report-8964218",
        "published": "2025-07-28T06:02:42Z",
        "summary": "AI Mode in Search first received a shortcut in the Google app for Android in April for those who registered for the Search Labs experiment. Now, as per a report, this shortcut is rolling out widely to more users globally. This shortcut icon appears primarily …",
        "description": "AI Mode in Search first received a shortcut in the Google app for Android in April for those who registered for the Search Labs experiment. Now, as per a report, this shortcut is rolling out widely t… [+1887 chars]",
        "source": "Gadgets360.com",
        "category": "trending",
        "image_url": "https://i.gadgets360cdn.com/large/ai_mode_2025_1746184294354.jpg",
        "key_points": [
          "AI Mode in Search first received a shortcut in the Google app for Android in April for those who registered for the Search Labs experiment.",
          "Now, as per a report, this shortcut is rolling out widely t 1887 chars.",
          "AI Mode Shortcut in Google for Android Said to Be Coming to More Users."
        ]
      },
      {
        "title": "How much pain do factory farm animals actually feel? How sensitive are they relative to humans?",
        "url": "https://www.lesswrong.com/posts/ZTLgfNWDJuQRgNdNn/how-much-pain-do-factory-farm-animals-actually-feel-how",
        "published": "2025-07-28T06:09:32Z",
        "summary": "Published on July 28, 2025 2:35 AM GMTFor context, I'm trying to get a sense of how bad factory farming is (and, by extension, our treatment of animals more generally). It seems obvious that factory farm animals feel some pain, but do we have any sense of how…",
        "description": "For context, I'm trying to get a sense of how bad factory farming is (and, by extension, our treatment of animals more generally). It seems obvious that factory farm animals feel some pain, but do we… [+845 chars]",
        "source": "Lesswrong.com",
        "category": "trending",
        "image_url": "https://res.cloudinary.com/lesswrong-2-0/image/upload/v1654295382/new_mississippi_river_fjdmww.jpg",
        "key_points": [
          "For context, Im trying to get a sense of how bad factory farming is and, by extension, our treatment of animals more generally.",
          "It seems obvious that factory farm animals feel some pain, but do we 845 chars.",
          "How sensitive are they relative to humans."
        ]
      }
    ],
    "regional": [
      {
        "title": "ICICI Bank (NYSE:IBN) Rating Lowered to Sell at Wall Street Zen",
        "url": "https://www.etfdailynews.com/2025/07/28/icici-bank-nyseibn-rating-lowered-to-sell-at-wall-street-zen/",
        "published": "2025-07-28T06:13:08Z",
        "summary": "ICICI Bank (NYSE:IBN – Get Free Report) was downgraded by stock analysts at Wall Street Zen from a “hold” rating to a “sell” rating in a research note issued to investors on Saturday. ICICI Bank Stock Down 0.5% Shares of NYSE IBN opened at $34.09 on Friday. T…",
        "description": "ICICI Bank (NYSE:IBN – Get Free Report) was downgraded by stock analysts at Wall Street Zen from a “hold” rating to a “sell” rating in a research note issued to investors on Saturday.\r\nICICI Bank Sto… [+3070 chars]",
        "source": "ETF Daily News",
        "category": "regional",
        "image_url": "https://www.americanbankingnews.com/wp-content/timthumb/timthumb.php?src=https://www.marketbeat.com/logos/icici-bank-ltd-logo-1200x675.jpg&w=240&h=240&zc=2",
        "key_points": [
          "ICICI Bank NYSE:IBN Get Free Report was downgraded by stock analysts at Wall Street Zen from a hold rating to a sell rating in a research note issued to investors on Saturday.",
          "ICICI Bank Sto 3070 chars."
        ]
      },
      {
        "title": "Comparing ESAB (NYSE:ESAB) & Highway (NASDAQ:HIHO)",
        "url": "https://www.etfdailynews.com/2025/07/28/comparing-esab-nyseesab-highway-nasdaqhiho/",
        "published": "2025-07-28T06:06:50Z",
        "summary": "ESAB (NYSE:ESAB – Get Free Report) and Highway (NASDAQ:HIHO – Get Free Report) are both industrials companies, but which is the better business? We will contrast the two businesses based on the strength of their risk, valuation, analyst recommendations, divid…",
        "description": "ESAB (NYSE:ESAB – Get Free Report) and Highway (NASDAQ:HIHO – Get Free Report) are both industrials companies, but which is the better business? We will contrast the two businesses based on the stren… [+5819 chars]",
        "source": "ETF Daily News",
        "category": "regional",
        "image_url": "https://www.americanbankingnews.com/wp-content/timthumb/timthumb.php?src=https://www.marketbeat.com/logos/highway-holdings-limited-logo-1200x675.jpg?v=20220131080518&w=240&h=240&zc=2",
        "key_points": [
          "Comparing ESAB NYSE:ESAB Highway NASDAQ:HIHO.",
          "ESAB NYSE:ESAB Get Free Report and Highway NASDAQ:HIHO Get Free Report are both industrials companies, but which is the better business.",
          "We will contrast the two businesses based on the stren 5819 chars."
        ]
      },
      {
        "title": "SC takes suo motu cognisance of report over dog bites leading to rabies",
        "url": "https://economictimes.indiatimes.com/news/india/sc-takes-suo-motu-cognisance-of-report-over-dog-bites-leading-to-rabies/articleshow/122946559.cms",
        "published": "2025-07-28T05:55:54Z",
        "summary": "The Supreme Court has initiated suo motu cognizance of a concerning media report highlighting the escalating incidents of dog bites resulting in rabies cases, particularly affecting children and the elderly in Delhi and its surrounding areas. The bench of Jus…",
        "description": "The Supreme Court on Monday took suo motu cognisance of a media report about incidents of dog bites leading to rabies.A bench of Justices J B Pardiwala and R Mahadevan termed the news item published … [+619 chars]",
        "source": "The Times of India",
        "category": "regional",
        "image_url": "https://img.etimg.com/thumb/msid-122946582,width-1200,height-630,imgsize-80846,overlay-economictimes/articleshow.jpg",
        "key_points": [
          "A bench of Justices J B Pardiwala and R Mahadevan termed the news item published 619 chars.",
          "SC takes suo motu cognisance of report over dog bites leading to rabies."
        ]
      },
      {
        "title": "Berlusconi’s MFE Raises Takeover Offer for Germany’s ProSieben",
        "url": "https://biztoc.com/x/1d99d03d684ad791",
        "published": "2025-07-28T06:16:41Z",
        "summary": "",
        "description": "{ window.open(this.href, '_blank'); }, 200); return false;\"&gt;What caused the US-EU 15% tariff trade deal? { window.open(this.href, '_blank'); }, 200); return false;\"&gt;How will Trumps tariffs impa… [+739 chars]",
        "source": "Biztoc.com",
        "category": "regional",
        "image_url": "https://biztoc.com/cdn/1d99d03d684ad791_s.webp",
        "key_points": [
          "Berlusconis MFE Raises Takeover Offer for Germanys ProSieben.",
          "href, _blank; , 200; return false;gt;How will Trumps tariffs impa 739 chars.",
          "href, _blank; , 200; return false;gt;What caused the US-EU 15 tariff trade deal."
        ]
      },
      {
        "title": "Budapest’s Most Historic Site Gets a Controversial Rebuild",
        "url": "https://biztoc.com/x/49da9b9dcab4cdb3",
        "published": "2025-07-28T06:16:38Z",
        "summary": "",
        "description": "{ window.open(this.href, '_blank'); }, 200); return false;\"&gt;What caused the US-EU 15% tariff trade deal? { window.open(this.href, '_blank'); }, 200); return false;\"&gt;How will Trumps tariffs impa… [+752 chars]",
        "source": "Biztoc.com",
        "category": "regional",
        "image_url": "https://biztoc.com/cdn/49da9b9dcab4cdb3_s.webp",
        "key_points": [
          "Budapests Most Historic Site Gets a Controversial Rebuild.",
          "href, _blank; , 200; return false;gt;How will Trumps tariffs impa 752 chars.",
          "href, _blank; , 200; return false;gt;What caused the US-EU 15 tariff trade deal."
        ]
      },
      {
        "title": "From Covent Garden to São Paulo: how IllustrationX attained true global reach",
        "url": "https://www.creativeboom.com/insight/from-covent-garden-to-so-paulo-how-illustrationx-attained-true-global-reach/",
        "published": "2025-07-28T06:15:00Z",
        "summary": "The leading illustration agency has spent decades creating a four-continent presence that's made it one of the biggest players in the market. We chatted to them to learn the secrets of their succes...",
        "description": "Forget the smoke and mirrors. While some illustration agencies slap the word \"global\" on a website and call it a day, IllustrationX has quietly built the real thing. A network of agents across four c… [+8921 chars]",
        "source": "Creative Boom",
        "category": "regional",
        "image_url": "https://www.creativeboom.com/upload/articles/71/714d0798f205354adce74e441ef29c4dae47bf97_800.jpg",
        "key_points": [
          "While some illustration agencies slap the word global on a website and call it a day, IllustrationX has quietly built the real thing.",
          "From Covent Garden to São Paulo: how IllustrationX attained true global reach.",
          "A network of agents across four c 8921 chars.",
          "Forget the smoke and mirrors."
        ]
      },
      {
        "title": "Q4 EPS Estimates for Las Vegas Sands Increased by Analyst",
        "url": "https://www.etfdailynews.com/2025/07/28/q4-eps-estimates-for-las-vegas-sands-increased-by-analyst/",
        "published": "2025-07-28T06:13:02Z",
        "summary": "Las Vegas Sands Corp. (NYSE:LVS – Free Report) – Research analysts at Seaport Res Ptn raised their Q4 2025 earnings estimates for Las Vegas Sands in a research note issued to investors on Thursday, July 24th. Seaport Res Ptn analyst V. Umansky now forecasts t…",
        "description": "Las Vegas Sands Corp. (NYSE:LVS – Free Report) – Research analysts at Seaport Res Ptn raised their Q4 2025 earnings estimates for Las Vegas Sands in a research note issued to investors on Thursday, J… [+5259 chars]",
        "source": "ETF Daily News",
        "category": "regional",
        "image_url": "https://www.americanbankingnews.com/wp-content/timthumb/timthumb.php?src=https://www.marketbeat.com/logos/las-vegas-sands-corp-logo-1200x675.png?v=20221101155803&w=240&h=240&zc=2",
        "key_points": [
          "Q4 EPS Estimates for Las Vegas Sands Increased by Analyst.",
          "NYSE:LVS Free Report Research analysts at Seaport Res Ptn raised their Q4 2025 earnings estimates for Las Vegas Sands in a research note issued to investors on Thursday, J 5259 chars."
        ]
      }
    ]
  },
  "by_source": {
    "The Times of India": [
      {
        "title": "Europe hopes for 'no surprises' as US weighs force withdrawals",
        "url": "https://economictimes.indiatimes.com/news/international/global-trends/europe-hopes-for-no-surprises-as-us-weighs-force-withdrawals/articleshow/122944480.cms",
        "published": "2025-07-28T03:59:35Z",
        "summary": "After keeping Donald Trump happy with a pledge to up defence spending at NATO's summit, Europe is now bracing for a key decision from the US president on the future of American forces on the continent. While successive US governments have mulled scaling back …",
        "description": "After keeping Donald Trump happy with a pledge to up defence spending at NATO's summit, Europe is now bracing for a key decision from the US president on the future of American forces on the continen… [+3974 chars]",
        "source": "The Times of India",
        "category": "geopolitics",
        "image_url": "https://img.etimg.com/thumb/msid-122944490,width-1200,height-630,imgsize-167082,overlay-economictimes/articleshow.jpg",
        "key_points": [
          "After keeping Donald Trump happy with a pledge to up defence spending at NATOs summit, Europe is now bracing for a key decision from the US president on the future of American forces on the continen 3974 chars.",
          "Europe hopes for no surprises as US weighs force withdrawals."
        ],
        "geopolitical_topic": "Ukraine war",
        "topic_type": "current_conflict"
      },
      {
        "title": "Taiwan reports continued Chinese military activity around its territory",
        "url": "https://economictimes.indiatimes.com/news/defence/taiwan-reports-continued-chinese-military-activity-around-its-territory/articleshow/122943704.cms",
        "published": "2025-07-28T02:56:58Z",
        "summary": "Taiwan's Defence Ministry reports Chinese military activity near its territory. Four Chinese aircraft and ten naval vessels were observed. The aircraft crossed the median line into Taiwan's air defence zone. This activity follows similar incursions reported o…",
        "description": "Taiwan's Ministry of Defence (MND) on Monday detected four sorties of PLA aircraft and detected 10 PLAN vessels operating around its territory.In a post on X, the MND stated that four out of four sor… [+2127 chars]",
        "source": "The Times of India",
        "category": "geopolitics",
        "image_url": "https://img.etimg.com/thumb/msid-122943709,width-1200,height-630,imgsize-11450,overlay-etdefence/articleshow.jpg",
        "key_points": [
          "Taiwans Ministry of Defence MND on Monday detected four sorties of PLA aircraft and detected 10 PLAN vessels operating around its territory.",
          "Taiwan reports continued Chinese military activity around its territory.",
          "In a post on X, the MND stated that four out of four sor 2127 chars."
        ],
        "geopolitical_topic": "China Taiwan",
        "topic_type": "current_conflict"
      }
    ],
    "International Business Times": [
      {
        "title": "Europe Hopes For 'No Surprises' As US Weighs Force Withdrawals",
        "url": "https://www.ibtimes.com/europe-hopes-no-surprises-us-weighs-force-withdrawals-3779583",
        "published": "2025-07-28T03:27:10Z",
        "summary": "After keeping Donald Trump happy with a pledge to up defence spending at NATO's summit, Europe is now bracing for a key decision from the US president on the future of American forces on the continent.",
        "description": "After keeping Donald Trump happy with a pledge to up defence spending at NATO's summit, Europe is now bracing for a key decision from the US president on the future of American forces on the continen… [+3870 chars]",
        "source": "International Business Times",
        "category": "geopolitics",
        "image_url": "https://d.ibtimes.com/en/full/4613136/united-states-conducting-review-its-military-deployments-worldwide.jpg",
        "key_points": [
          "After keeping Donald Trump happy with a pledge to up defence spending at NATOs summit, Europe is now bracing for a key decision from the US president on the future of American forces on the continen 3870 chars.",
          "Europe Hopes For No Surprises As US Weighs Force Withdrawals."
        ],
        "geopolitical_topic": "Ukraine war",
        "topic_type": "current_conflict"
      }
    ],
    "New York Post": [
      {
        "title": "Kim Jong Un’s powerful sister rejects appeasement overture by South’s new president",
        "url": "https://nypost.com/2025/07/27/world-news/kim-jong-uns-powerful-sister-rejects-appeasement-overture-by-souths-new-president/",
        "published": "2025-07-28T01:59:52Z",
        "summary": "Kim Jong Un's sister dismisses South Korea's peace offers, reaffirming no interest in talks.",
        "description": "SEOUL, South Korea  The influential sister of North Korean leader Kim Jong Un rebuffed an appeasement overture by South Koreas new liberal government, saying Monday that North Korea has no interests … [+3816 chars]",
        "source": "New York Post",
        "category": "geopolitics",
        "image_url": "https://nypost.com/wp-content/uploads/sites/2/2025/07/kim-jong-uns-powerful-sister-108858951.jpg?quality=75&strip=all&w=1024",
        "key_points": [
          "SEOUL, South Korea The influential sister of North Korean leader Kim Jong Un rebuffed an appeasement overture by South Koreas new liberal government, saying Monday that North Korea has no interests 3816 chars.",
          "Kim Jong Uns powerful sister rejects appeasement overture by Souths new president."
        ],
        "geopolitical_topic": "Ukraine war",
        "topic_type": "current_conflict"
      }
    ],
    "Politico": [
      {
        "title": "Powerful sister of North Korean leader Kim rejects outreach by South’s new president",
        "url": "https://www.politico.com/news/2025/07/27/powerful-sister-of-north-korean-leader-kim-rejects-outreach-by-souths-new-president-00479597",
        "published": "2025-07-28T01:59:27Z",
        "summary": "Kim Yo Jong said her government has \"no interest\" in talks.",
        "description": "SEOUL, South Korea The influential sister of North Korean leader Kim Jong Un rebuffed overtures by South Koreas new liberal government, saying Monday that North Korea has no interests in talks with S… [+3221 chars]",
        "source": "Politico",
        "category": "geopolitics",
        "image_url": "https://s.yimg.com/ny/api/res/1.2/XhCJTRBs351EaWkh4w9I0g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04NzM7Y2Y9d2VicA--/https://media.zenfs.com/en/politico_453/9ee9c1fda911b43801951f589ca5a0f1",
        "key_points": [
          "Powerful sister of North Korean leader Kim rejects outreach by Souths new president.",
          "SEOUL, South Korea The influential sister of North Korean leader Kim Jong Un rebuffed overtures by South Koreas new liberal government, saying Monday that North Korea has no interests in talks with S 3221 chars."
        ],
        "geopolitical_topic": "Ukraine war",
        "topic_type": "current_conflict"
      }
    ],
    "ETF Daily News": [
      {
        "title": "Pixelworks (NASDAQ:PXLW) Upgraded to “Sell” at Wall Street Zen",
        "url": "https://www.etfdailynews.com/2025/07/28/pixelworks-nasdaqpxlw-upgraded-to-sell-at-wall-street-zen/",
        "published": "2025-07-28T05:52:46Z",
        "summary": "Pixelworks (NASDAQ:PXLW – Get Free Report) was upgraded by analysts at Wall Street Zen to a “sell” rating in a research note issued to investors on Saturday. PXLW has been the subject of a number of other research reports. Needham & Company LLC reiterated a “…",
        "description": "Pixelworks (NASDAQ:PXLW – Get Free Report) was upgraded by analysts at Wall Street Zen to a “sell” rating in a research note issued to investors on Saturday.\r\nPXLW has been the subject of a number of… [+2909 chars]",
        "source": "ETF Daily News",
        "category": "geopolitics",
        "image_url": "https://www.americanbankingnews.com/wp-content/timthumb/timthumb.php?src=https://www.marketbeat.com/logos/pixelworks-logo-1200x675.gif&w=240&h=240&zc=2",
        "key_points": [
          "Pixelworks NASDAQ:PXLW Get Free Report was upgraded by analysts at Wall Street Zen to a sell rating in a research note issued to investors on Saturday.",
          "PXLW has been the subject of a number of 2909 chars."
        ],
        "geopolitical_topic": "China Taiwan",
        "topic_type": "current_conflict"
      }
    ]
  },
  "api_status": {
    "geopolitics": {
      "status": "success",
      "total_articles": 6,
      "topics_covered": 2
    }
  },
  "api_usage": {
    "primary_key_requests": 1,
    "secondary_key_requests": 2,
    "tertiary_key_requests": 9,
    "total_requests": 12,
    "available_keys": 3,
    "exhausted_keys": 2,
    "current_key": "tertiary",
    "remaining_quota": 91
  }
}